<div>
    <h3> A Model Peer-to-Peer Retail Application Database </h3>
    <h3> Micah Simmerman </h3>
    <h3> CSPB 3287 Semester Project </h3>
</div>

Introduction

## Logistics

The following will load the SQL extension and connect to the `patent_citations` database using your MySQL credentials.

In [2]:
import os
import configparser
from sqlalchemy import create_engine, select
import sqlalchemy.sql

mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")

database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url 
eng = create_engine(db_url)
con = eng.connect()

User    : [jasi9001]
Database: [[mysql://jasi9001...@applied-sql.cs.colorado.edu:3306/jasi9001]

In [3]:
%reload_ext sql
%matplotlib inline
%sql SELECT version()

1 rows affected.

[('8.0.27',)]

In [40]:
%%sql
drop table if exists user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [32]:
%%sql
drop table if exists adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [31]:
%%sql
DROP TABLE IF EXISTS user_address;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [34]:
%%sql
drop table if exists user_payment;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [39]:
%%sql
drop table if exists product_category;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [38]:
%%sql
drop table if exists product;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [37]:
%%sql
drop table if exists product_inventory;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

# Introduction
This project is about creating flexible schemas that can handle a <strong>lot</strong> of data. In this python notebook, you will notice that each primary key declaration is an AUTO_INCREMENT integer. You will also see creation and modification timestamps included with each record. 

The primary reason for doing things this way is: 1.) to structure data in a meaningful way, and 2.) increase the db's compatibility with alternative database schemas, including noSQL platforms like MongoDB. 

An auto-incremented primary key means that the data remains in chronologically-searchable order that is tamper evident. Placing additional meta-data in each record makes them easy to store, transport, manipulate, and range query. The tables in this notebook are constructed to support software in multiple ways that range in complexity from basic user information storage to complex financial transactions involving credit card data.

# The User-Admin Management Tier
<b><hr/></b>

In [41]:
%%sql
# User table is the central table in the user-admin management section.
CREATE TABLE user (
    user_id INT PRIMARY KEY AUTO_INCREMENT,
    username VARCHAR(30) UNIQUE,
    password NVARCHAR(30),
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    email VARCHAR(300) UNIQUE,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [22]:
user_data_1 = [["user_01","user_passwd_01","Joe","Murr", "user_01_@email.com"],
               ["user_02","user_passwd_02","Brice","Toven", "user_02_@email.com"],
               ["user_03","user_passwd_03","Jen","Jackson", "user_03_@email.com"],
               ["user_04","user_passwd_04","Tammy","Smith", "user_04_@email.com"],
               ["user_05","user_passwd_05","Melanie ","Baldwin", "user_05_@email.com"],
               ["admin_06","admin_passwd_06","Rene ","Pratt", "admin_06_@email.com"],
               ["admin_07","admin_passwd_07","Malik ","Coleman", "admin_07_@email.com"],
               ["admin_08","admin_passwd_08","Sheldon ","Wolf", "admin_08_@email.com"],
               ["admin_09","admin_passwd_09","Ramiro","Blackwell", "admin_09_@email.com"],
               ["admin_10","admin_passwd_10","Suzy","Q", "admin_10_@email.com"],  # Ramiro made two accounts
               # The next two inserts should fail due to UNIQUE unsername and email constraints, respectively.
               ["user_01","test_password_01","Duplicate","Username", "un_test_email@email.com"],
               ["poser_08","test_password_08","Duplicate","Email", "user_01_@email.com"]
              ]

In [23]:
insert_users = """
INSERT INTO 
    user (username, password, first_name, last_name, email)
VALUES
    ("%s","%s","%s","%s", "%s");
"""
count = 1
for user in user_data_1:
    try:
        res = con.execute(insert_users, user[0], user[1], user[2], user[3], user[4])
        print("Insert:", user[2], user[3], "insert was successful.")
    except:
        print("Insert:", user[2], user[3], " insert FAILED.")
    count+=1

Insert: Joe Murr  insert FAILED.
Insert: Brice Toven  insert FAILED.
Insert: Jen Jackson  insert FAILED.
Insert: Tammy Smith  insert FAILED.
Insert: Melanie  Baldwin  insert FAILED.
Insert: Rene  Pratt  insert FAILED.
Insert: Malik  Coleman  insert FAILED.
Insert: Sheldon  Wolf  insert FAILED.
Insert: Ramiro Blackwell  insert FAILED.
Insert: Suzy Q  insert FAILED.
Insert: Duplicate Username  insert FAILED.
Insert: Duplicate Email  insert FAILED.

In [24]:
%%sql
SELECT * FROM user;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
10 rows affected.

[(1, "'user_01'", "'user_passwd_01'", "'Joe'", "'Murr'", "'user_01_@email.com'", datetime.datetime(2023, 4, 24, 0, 42, 17), datetime.datetime(2023, 4, 24, 0, 42, 17)),
 (2, "'user_02'", "'user_passwd_02'", "'Brice'", "'Toven'", "'user_02_@email.com'", datetime.datetime(2023, 4, 24, 0, 42, 17), datetime.datetime(2023, 4, 24, 0, 42, 17)),
 (3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", 'brice_toven_07@gmail.com', datetime.datetime(2023, 4, 24, 0, 42, 17), datetime.datetime(2023, 4, 24, 0, 42, 22)),
 (4, "'user_04'", "'user_passwd_04'", "'Tammy'", "'Smith'", "'user_04_@email.com'", datetime.datetime(2023, 4, 24, 0, 42, 17), datetime.datetime(2023, 4, 24, 0, 42, 17)),
 (5, "'user_05'", "'user_passwd_05'", "'Melanie '", "'Baldwin'", "'user_05_@email.com'", datetime.datetime(2023, 4, 24, 0, 42, 18), datetime.datetime(2023, 4, 24, 0, 42, 18)),
 (6, "'admin_06'", "'admin_passwd_06'", "'Rene '", "'Pratt'", "'admin_06_@email.com'", datetime.datetime(2023, 4, 24, 0, 42, 18), datetime.datetime(2023, 4, 24, 0, 42, 18)),
 (7, "'admin_07'", "'admin_passwd_07'", "'Malik '", "'Coleman'", "'admin_07_@email.com'", datetime.datetime(2023, 4, 24, 0, 42, 18), datetime.datetime(2023, 4, 24, 0, 42, 18)),
 (8, "'admin_08'", "'admin_passwd_08'", "'Sheldon '", "'Wolf'", "'admin_08_@email.com'", datetime.datetime(2023, 4, 24, 0, 42, 18), datetime.datetime(2023, 4, 24, 0, 42, 18)),
 (9, "'admin_09'", "'admin_passwd_09'", "'Ramiro'", "'Blackwell'", "'admin_09_@email.com'", datetime.datetime(2023, 4, 24, 0, 42, 18), datetime.datetime(2023, 4, 24, 0, 42, 18)),
 (22, "'admin_10'", "'admin_passwd_10'", "'Suzy'", "'Q'", "'admin_10_@email.com'", datetime.datetime(2023, 4, 30, 2, 37, 10), datetime.datetime(2023, 4, 30, 2, 37, 10))]

## This schema is also compatible with noSQL databases, such as MongoDB.

## Test the 'modified_at' on-update timestamp trigger.
<p>Now we can see if the on-update trigger was placed on <b>user.modified_at</b>.</p>

In [9]:
%%sql
# Change Brice Toven's email to make sure the update trigger is working properly.
UPDATE user
SET
    email = 'brice_toven_07@gmail.com'  # CHANGE THIS VALUE TO SEE THE UPDATE TRIGGER
WHERE
    user_id = 3;
    
SELECT * FROM user WHERE user_id = 3;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.
1 rows affected.

[(3, "'user_03'", "'user_passwd_03'", "'Jen'", "'Jackson'", 'brice_toven_07@gmail.com', datetime.datetime(2023, 4, 24, 0, 42, 17), datetime.datetime(2023, 4, 24, 0, 42, 22))]

# LOGICAL BREAK

## The 'adminuser' table is a weak entity of the 'user' table.

### Rene Pratt, Malik Coleman, Sheldon Wolf, and Ramiro Blackwell have different roles in the P2P Ecommmerce system. 

    -Rene is a Business Admin for company X, a company that sells items through the platform. She needs access to create and modify her company's new product listings.
    -Malik is a requisitioner for Company X, where he manages inventory.
    -Sheldon works in the IT department of the P2P company, he has been on a real roll lately.
    -Ramiro works in one of the shipping warehouses, he needs access to check on the status of existing orders.

### Assume that the "admin_type" column determines the adminuser's data access permissions.

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [18]:
%%sql
# The admin_user table consumed the admin_type table, it presents a much more normalized form.
CREATE TABLE adminuser (
    admin_id INT PRIMARY KEY,  # foreign key, references 'user.user_id'
    first_name VARCHAR(30),
    last_name VARCHAR(30),
    admin_type VARCHAR(30),  # BusinessAdmin / Requisitioner / IT / Warehouse
    permissions VARCHAR(30),  # '01_admin' / '02_purchaser' / '03_IT' / '04_warehouse'
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    CONSTRAINT ADMINUSER_isA_USER FOREIGN KEY (admin_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);
#

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

In [19]:
admins = [[6, "Rene ","Pratt", 'BusinessAdmin', '01_admin'],
          [7, "Malik ","Coleman", 'Requisitioner', '02_purchaser'],
          [8,  'IT', "Sheldon ", "Wolf", '03_IT'],
          [9, "Ramiro","Blackwell", 'Warehouse', '04_warehouse'],
          [10, "Suzy","Q", 'Warehouse', '04_warehouse']]

In [20]:
insert_admins = """
INSERT INTO 
    adminuser (admin_id, first_name, last_name, admin_type, permissions)
VALUES
    ("%s","%s","%s","%s","%s");
"""

for admin in admins:
    # res = con.execute(insert_admins, admin[0], admin[1], admin[2])
    try:
        res = con.execute(insert_admins, admin[0], admin[1], admin[2], admin[3], admin[4])
        print("Insert for admin id:", admin[1], admin[2], "was successful.")
    except:
        print("Insert for admin id:", admin[1], admin[2], "has FAILED.")

Insert for admin id: Rene  Pratt was successful.
Insert for admin id: Malik  Coleman was successful.
Insert for admin id: IT Sheldon  was successful.
Insert for admin id: Ramiro Blackwell was successful.
Insert for admin id: Suzy Q has FAILED.

### We can use this table to control each admin-user's access pattern priveledges. 
### Sheldon just recieved a promotion that grants him a higher permission status, let's upgrade his permissions using his employee ID number.

In [1]:
%%sql
UPDATE adminuser
SET
    permissions = '04_IT'
WHERE
    admin_id = 8;
    
SELECT * FROM adminuser WHERE admin_id = '6';

UsageError: Cell magic `%%sql` not found.

### Note the modified_at timestamp above. 
### Checking that the on-delete-cascade trigger works. It was added onto the foreign key constraint when the adminuser table was created.

In [450]:
%%sql
select * from adminuser;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
4 rows affected.

[(6, "'BusinessAdmin'", '02_admin', datetime.datetime(2023, 4, 24, 0, 42, 34), datetime.datetime(2023, 4, 24, 0, 43, 4)),
 (7, "'Requisitioner'", "'02_purchaser'", datetime.datetime(2023, 4, 24, 0, 42, 34), datetime.datetime(2023, 4, 24, 0, 42, 34)),
 (8, "'IT'", "'03_IT'", datetime.datetime(2023, 4, 24, 0, 42, 34), datetime.datetime(2023, 4, 24, 0, 42, 34)),
 (9, "'Warehouse'", "'04_warehouse'", datetime.datetime(2023, 4, 24, 0, 42, 34), datetime.datetime(2023, 4, 24, 0, 42, 34))]

### This cell contains a destructive test to verify that the on-delete-cascade trigger is working. Upon deletion of a record in the user table, all records associated with that user are deleted from the adminuser table also.

In [449]:
%%sql
# remember to rebuild the table after this.
DELETE FROM user WHERE user_id = 10;  # delete user_id=10 from the user table. (to view the cascade)

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[]

# LOGICAL BREAK

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [451]:
%%sql
# 
CREATE TABLE user_address (
    address_id INT PRIMARY KEY AUTO_INCREMENT,  # this will give us all the information we need to know about a given address (for receipts and such).
    user_id INT,  #  user_address.user_id refers to user.user_id
    address_line1 VARCHAR(100) NOT NULL,  # e.g., 1312 Cherry Basket ln.
    address_line2 VARCHAR(100),  # e.g., Unit 2
    city VARCHAR(40) NOT NULL,  # e.g., Midland
    state VARCHAR(15) NOT NULL,  # e.g., Texas
    postal_code VARCHAR(15) NOT NULL, # e.g., 79701
    country VARCHAR(56),  # e.g., United States
    phone_number VARCHAR(15) NOT NULL, # e.g., (702)579-0585
    
    CONSTRAINT USER_ADDRESS_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE # 
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

### It will be handy to keep and index on user_id, since this attribute is referenced by most of the tables in the user-admin section, and it is not a primary key in most of these tables.

In [466]:
%%sql
# Because this is what conects user_address to the user table, we want to place an index on user_address.user_id.
CREATE INDEX USER_PAYMENT_INDEX  
ON user_address (user_id);

In [454]:
user_addresses = [[1, "8447C Airport Street", "Apt#2", "Klamath Falls","OR", "97603", "United States", "(102)479-4505"],
                  [2, "328 Saxton St.", "N/A", "Englewood","NJ", "07631", "United States", "(202)484-0535"],
                  [3, "8539 W. Olive Court", "N/A", "Bemidji","MN", "56601", "United States", "(502)474-7505"],
                  [4, "467 Cooper St.", "N/A", "Ottumwa","IA", "52501", "United States", "(702)579-0585"],
                  [5, "9154 Main Court", "N/A", "Latrobe","PA", "15650", "United States", "(702)579-0585"],
                  [6, "7019 E. Border Street", "N/A", "Strongsville","Strongsville", "OH", "United States", "(702)579-0585"],
                  [7, "819 Aspen Ave.", "N/A", "Maplewood","NJ", "07040", "United States", "(702)579-0585"],
                  [8, "admin_08","9216 W. Greenview Ave.", "N/A", "Williamstown","NJ", "08094", "United States", "(502)479-4505"],
                  [9,"426 N. Bay Meadows Rd.", "N/A", "Largo","FL", "33771", "United States", "(402)455-4599"],
                  # Inserting multiple records with the same user_id is allowed. Next insert should pass.
                  [8,"8546 Laurel Ave.","N/A","Avon Lake", "OH", "44012", "United States", "(102)479-4505"],                  
                  # The last insert should fail because this user_id does not exist in user table. So it should fail according to the FK constraint.
                  [11,"8320 W. Brookside Street","N/A","Streamwood", "IL", "60107", "United States", "(102)479-4505"],
                 ]

In [29]:
insert_user_address = """
INSERT INTO 
    user_address (user_id, address_line1, address_line2, city, state, postal_code, country, phone_number)
VALUES
    ("%s","%s","%s","%s","%s","%s","%s","%s");
"""

for user in user_addresses:
    # res = con.execute(insert_admins, admin[0], admin[1], admin[2])
    try:
        res = con.execute(insert_user_address, user[0], user[1], user[2], user[3], user[4], user[5], user[6], user[7])
        print("user_id:", user[0], "'s address was inserted successfully.")
    except:
        print("user_id:", user[0], "'s address insertion FAILED.")

NameError: name 'user_addresses' is not defined

# Create the user_payment table.

### The Ecommerce Company has decided to accept only credit or debit cards.

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [532]:
%%sql
CREATE TABLE user_payment (
    payment_id INT PRIMARY KEY AUTO_INCREMENT,  # good to keep track of payment options.
    user_id INT NOT NULL,  # Foreign key that references user.user_id
    payment_type VARCHAR(40) NOT NULL,  # e.g.,          'DEBIT'            ...     'CREDIT'
    provider VARCHAR(100) NOT NULL,  # e.g., '(WELLS FARGO' | 'CHASE'| ...) ... ('VISA' | 'DISCOVERY' | ...) 
    card_number VARCHAR(20) NOT NULL,
    cvc VARCHAR(10) NOT NULL,  # always 3 numbers
    expiry VARCHAR(10),  # e.g., '2025-07' (cards typically expire the first day of the month.)
    
    # CONSTRAINT PAYMENT_TYPE_NO_DUPS UNIQUE(user_id, provider, card_number),  # users can have only one instance of each E-transfer provider, and one instance of each card.
    CONSTRAINT USER_PAYMENT_FK FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

### It will be handy to keep and index on user_id, since this attribute is referenced by most of the tables in the user-admin section.

In [533]:
%%sql
# Because this is what conects user_address to the user table, we want to place an index on user_address.user_id.
CREATE INDEX USER_PAYMENT_INDEX  
ON user_payment (user_id);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

### Since neither 'user_id' and 'card_number' are primary keys, I have placed a unique non-clustered index on the two attributes two ensure that the table rejects duplicate card information for each user_id. [see tests below]

In [534]:
%%sql
# Using a pre-insert trigger to prevent duplicate payment options from being entered into the table.
ALTER TABLE user_payment   
ADD CONSTRAINT NO_PAYMENT_DUPS UNIQUE NONCLUSTERED
(
    user_id, card_number
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [535]:
user_payment_methods = [[1, "DEBIT", "CHASE", "4485202750970764", "505", "05/2024"],
                        [1, "CREDIT", "VISA", "4485858039365496", "391", "9/2023"], # user can have multiple cards
                        [2, "DEBIT", "VISA", "4539447657840026", "924", "07/2025"], 
                        [2, "CREDIT", "VISA", "4716013835369778", "804", "12/2024"], # 
                        [3, "CREDIT", "VISA", "4556994540374919", "536", "03/2022"],
                        [4, "DEBIT", "VISA", "4929053913134176", "958", "11/2023"],
                        [5, "CREDIT", "DISCOVERY", "4485596057592985", "713", "08/2029"],
                        [6, "CREDIT", "VISA", "4539628822621173", "121", "01/2028"],
                        [7, "CREDIT", "DISCOVERY", "4842467639356646", "548", "02/2026"],
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"],
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],
                        # The user_payment table does not allow duplicate payment information to be entered into the table. 
                        [9, "CREDIT", "VISA", "4532191431974902", "267", "10/2025"],  # FAIL -- duplicate card number
                        [8, "DEBIT", "DISCOVERY", "4485944095819335", "788", "07/2024"]]  # FAIL -- duplicate card number

In [536]:
insert_user_payment = """
INSERT INTO 
    user_payment (user_id, payment_type, provider, card_number, cvc, expiry)
VALUES
    ("%s","%s","%s","%s","%s", "%s");
"""

for payment in user_payment_methods:
    try:
        res = con.execute(insert_user_payment, payment[0], payment[1], payment[2], payment[3], payment[4], payment[5])
        print("SUCCESS! user_id", payment[0], "'s payment info was inserted into 'user_payment'")
    except:
        print("FAILED. could not insert user_id", payment[0], "'s payment information")

SUCCESS! user_id 1 's payment info was inserted into 'user_payment'
SUCCESS! user_id 1 's payment info was inserted into 'user_payment'
SUCCESS! user_id 2 's payment info was inserted into 'user_payment'
SUCCESS! user_id 2 's payment info was inserted into 'user_payment'
SUCCESS! user_id 3 's payment info was inserted into 'user_payment'
SUCCESS! user_id 4 's payment info was inserted into 'user_payment'
SUCCESS! user_id 5 's payment info was inserted into 'user_payment'
SUCCESS! user_id 6 's payment info was inserted into 'user_payment'
SUCCESS! user_id 7 's payment info was inserted into 'user_payment'
SUCCESS! user_id 8 's payment info was inserted into 'user_payment'
SUCCESS! user_id 9 's payment info was inserted into 'user_payment'
FAILED. could not insert user_id 9 's payment information
FAILED. could not insert user_id 8 's payment information

In [537]:
%%sql
select * from user_payment
order by user_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
11 rows affected.

[(1, 1, "'DEBIT'", "'CHASE'", "'4485202750970764'", "'505'", "'05/2024'"),
 (2, 1, "'CREDIT'", "'VISA'", "'4485858039365496'", "'391'", "'9/2023'"),
 (3, 2, "'DEBIT'", "'VISA'", "'4539447657840026'", "'924'", "'07/2025'"),
 (4, 2, "'CREDIT'", "'VISA'", "'4716013835369778'", "'804'", "'12/2024'"),
 (5, 3, "'CREDIT'", "'VISA'", "'4556994540374919'", "'536'", "'03/2022'"),
 (6, 4, "'DEBIT'", "'VISA'", "'4929053913134176'", "'958'", "'11/2023'"),
 (7, 5, "'CREDIT'", "'DISCOVERY'", "'4485596057592985'", "'713'", "'08/2029'"),
 (8, 6, "'CREDIT'", "'VISA'", "'4539628822621173'", "'121'", "'01/2028'"),
 (9, 7, "'CREDIT'", "'DISCOVERY'", "'4842467639356646'", "'548'", "'02/2026'"),
 (10, 8, "'DEBIT'", "'DISCOVERY'", "'4485944095819335'", "'788'", "'07/2024'"),
 (11, 9, "'CREDIT'", "'VISA'", "'4532191431974902'", "'267'", "'10/2025'")]

# Testing the User-Admin Tier
## A credit card promotion is being offered to company employees.
### Find the first_name, last_name, email, and admin_type of employees with a DISCOVERY credit card on file to shop at the Site.

In [476]:
%%sql
# Use Common Table Expressions.
WITH admin_users AS (
    SELECT 
        adminuser.admin_id AS 'user_id', user.first_name AS 'first_name', user.last_name AS 'last_name', adminuser.admin_type AS 'admin_type', 
            user.email AS 'email' 
    FROM 
        adminuser
    INNER JOIN
        user
    ON
        adminuser.admin_id = user.user_id
),

discovery_holders AS (
    SELECT 
        admin_users.first_name AS 'first_name', admin_users.last_name AS 'last_name', 
            admin_users.email AS 'email', admin_users.admin_type AS 'job_title'
    FROM 
        admin_users
    INNER JOIN
        user_payment
    ON
        admin_users.user_id = user_payment.user_id
    WHERE 
        user_payment.provider LIKE '\'DISCOVERY\'' AND user_payment.payment_type LIKE '\'CREDIT\''
)

SELECT * FROM discovery_holders;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
1 rows affected.

[("'Malik '", "'Coleman'", "'admin_07_@email.com'", "'Requisitioner'")]

# The Product Management Tier

The 'product' table has a one-to-one relationship with 'product_inventory'. The relationship between the 'product' and 'product_category' tables is 1-1(0) or optional. The same goes for the 'product' and 'product_discount' tables.

## The 'product_category' table

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
(MySQLdb._exceptions.OperationalError) (3730, "Cannot drop table 'product_category' referenced by a foreign key constraint 'PRODUCT_isA_CATEGORY' on table 'product'.")
[SQL: drop table if exists product_category;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [518]:
%%sql
CREATE TABLE product_category (
    category_id INT PRIMARY KEY,  # This PK is referenced by product.category_id
    category_name VARCHAR(50) UNIQUE NOT NULL,  # 
    category_desc VARCHAR(400),  #
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,  # 
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);  
# Products belong to a product category, but the category can change, and even be NULL (product still exists if category is deleted).

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.
0 rows affected.

[]

In [539]:
# category_id is NOT auto-increment. Product categories is in many ways, already an index.
product_categories = [[1, "outdoor_gear", "Camping, Fishing, and Hiking gear."],
                      [2, "mens_clothing", "The latest fashions in menswear."],
                      [3, "mens_shoes", "Find a great fit."],
                      [4, "womens_clothing", "Seasonal fashions, clearance prices."],
                      [5, "womens_shoes", "We know shoes."],
                      [6, "garden_supplies", "Lawn, garden, and landscaping supplies."],
                      [7, "sports_equipment", "Soccer, footbal, basketball, baseball and more."],
                      [8, "electronics", "Top tech gadgets."],
                      [9, "grocery", "Fresh produce, dairy, Deli and more."],
                      [10, "automotive", "Oil, tire, and car care products."]
                     ]

### Run the following cell twice to see how product_category table prevents duplicate entries.

In [547]:
insert_product_categories = """
INSERT INTO 
    product_category (category_id, category_name, category_desc)
VALUES
    ("%s","%s","%s");
"""

for category in product_categories:
    try:
        res = con.execute(insert_product_categories, category[0], category[1], category[2])
        print("SUCCESS! category_id", category[0], "was inserted into 'product_category'")
    except:
        print("FAILED. Could not insert category_id", category[0], "into 'product_category'")

FAILED. Could not insert category_id 1 into 'product_category'
FAILED. Could not insert category_id 2 into 'product_category'
FAILED. Could not insert category_id 3 into 'product_category'
FAILED. Could not insert category_id 4 into 'product_category'
FAILED. Could not insert category_id 5 into 'product_category'
FAILED. Could not insert category_id 6 into 'product_category'
FAILED. Could not insert category_id 7 into 'product_category'
FAILED. Could not insert category_id 8 into 'product_category'
FAILED. Could not insert category_id 9 into 'product_category'
FAILED. Could not insert category_id 10 into 'product_category'

## The 'product' table

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [75]:
%%sql
CREATE TABLE product (
    product_id INT PRIMARY KEY AUTO_INCREMENT,  # NEW KING
    category_id INT,  # foreign key referencing product_category.category_id. Set NULL ON DELETE.
    product_name VARCHAR(100), 
    product_desc VARCHAR(400), 
    sku VARCHAR(15) UNIQUE, 
    price DECIMAL(13, 2),  # price must be kept as a decimal for computing discounts
    
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    # If the category is deleted then all we have is a product without a category. => '...ON DELETE SET NULL'
    CONSTRAINT PRODUCT_isA_CATEGORY FOREIGN KEY (category_id) REFERENCES product_category(category_id) ON DELETE SET NULL
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

## SKU: 'XXX-YYY-ZZZ'
### 'XXX' = number reflecting the order of entry into a product category (under a single vendor).
### 'YYY' = three letter abbreviation for the product category.
### 'ZZZ' = vendor ID.

In [76]:
product_list = [[1, "Outdoor Recliner", "Fold-up canvas camping chair.", "001-OUT-001", 199.99],
                [2, "Men's Hooded Fleece", "Soft, warm and comfy men's outer garment.", "001-MNC-003", 119.99],
                [3, "Casual Loafers", "Comfortable mens shoes.", "001-MNS-001", 59.99],
                [4, "Women's Scarf", "Fashionable women's scarf.", "001-WMC-002", 34.99],
                [5, "Women's Slip-Ons", "Cozy women's slip-ons.", "001-WMS-002", 44.99],
                [6, "Cloth Planter Pots", "Cloth planter for fruits and veggetables.", "001-GSP-002", 10.99],
                [7, "Men's Basketball", "Top-shelf men's basketball.", "001-SPT-003", 59.99],
                [8, "Iphone28", "The latest Iphone technology.", "001-ELC-004", 999.99],
                [9, "Fresh Bagels", "Fresh bagels, delivered from our a bakery.", "001-GRO-005", 6.99],
                [10, "Air Freshener", "Clip on vent air freshener.", "001-AUT-001", 6.99],
                [7, "Duplicate SKU", "Duplicate SKU test.", "001-AUT-001", 6.99],  # Duplicate SKU's should fail the insert test.
                [7, "Duplicate SKU", "Duplicate SKU test.", "001-GRO-005", 6.99],
               ]
# might wish to sort by category id.

In [77]:
insert_products = """
INSERT INTO 
    product (category_id, product_name, product_desc, sku, price)
VALUES
    ("%s","%s","%s","%s","%s");
"""

for product in product_list:
    try:
        res = con.execute(insert_products, product[0], product[1], product[2], product[3], product[4])
        print("SUCCESS! inserted product:", "'" + product[1] + "'|", "SKU:", product[3])
    except:
        print("FAILED. Could not insert product:", "'" + product[1] + "'|", "SKU:", product[3])

SUCCESS! inserted product: 'Outdoor Recliner'| SKU: 001-OUT-001
SUCCESS! inserted product: 'Men's Hooded Fleece'| SKU: 001-MNC-003
SUCCESS! inserted product: 'Casual Loafers'| SKU: 001-MNS-001
SUCCESS! inserted product: 'Women's Scarf'| SKU: 001-WMC-002
SUCCESS! inserted product: 'Women's Slip-Ons'| SKU: 001-WMS-002
SUCCESS! inserted product: 'Cloth Planter Pots'| SKU: 001-GSP-002
SUCCESS! inserted product: 'Men's Basketball'| SKU: 001-SPT-003
SUCCESS! inserted product: 'Iphone28'| SKU: 001-ELC-004
SUCCESS! inserted product: 'Fresh Bagels'| SKU: 001-GRO-005
SUCCESS! inserted product: 'Air Freshener'| SKU: 001-AUT-001
FAILED. Could not insert product: 'Duplicate SKU'| SKU: 001-AUT-001
FAILED. Could not insert product: 'Duplicate SKU'| SKU: 001-GRO-005

The 'product_id' primary key is auto-increment and therefore not under the control of the primary user. Listing products with auto-increment primary key stores these records in primary chronological order. Storing records in chronological order can be very helpful in the case of a DB failure, and stores records at a predictable location upon each insert into a table. 

Notes:
A business-specific SKU forms the central mechanism for unique product tracing in many businesses. The 'product_id' attribute automatically creates a permanent chronological index on each product listing. This design choice carries many unique benefits to existing data structures and improves table clarity by giving a clear indication of missing and/or altered records.

We can sort the records by price, category, basically anything we want! The important thing to understand about the product management tier is that this database will form the persistence layer of an application that relies on it for information. The goal of the Product Management Tier is to create an 

SKU generation protocols can become quite sophisticated, but these systems allow for as much flexibility as may be required by the inventory management system. In this case, we assume that the SKU must be generated for each unique product sold under a single vendor.

## Now we can list each product with it's category name.

In [78]:
%%sql 
SELECT
    product_category.category_name AS 'Category', product.product_name AS 'Product Name', product.product_desc AS 'Product Description', 
        product.sku AS 'SKU', product.price AS 'Price', product.created_at AS 'created_at', product.modified_at AS 'modified_at'
FROM
    product_category
INNER JOIN
    product
ON
    product.category_id = product_category.category_id;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
10 rows affected.

[("'outdoor_gear'", "'Outdoor Recliner'", "'Fold-up canvas camping chair.'", "'001-OUT-001'", Decimal('199.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5)),
 ("'mens_clothing'", "'Men's Hooded Fleece'", "'Soft, warm and comfy men's outer garment.'", "'001-MNC-003'", Decimal('119.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5)),
 ("'mens_shoes'", "'Casual Loafers'", "'Comfortable mens shoes.'", "'001-MNS-001'", Decimal('59.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5)),
 ("'womens_clothing'", "'Women's Scarf'", "'Fashionable women's scarf.'", "'001-WMC-002'", Decimal('34.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5)),
 ("'womens_shoes'", "'Women's Slip-Ons'", "'Cozy women's slip-ons.'", "'001-WMS-002'", Decimal('44.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5)),
 ("'garden_supplies'", "'Cloth Planter Pots'", "'Cloth planter for fruits and veggetables.'", "'001-GSP-002'", Decimal('10.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5)),
 ("'sports_equipment'", "'Men's Basketball'", "'Top-shelf men's basketball.'", "'001-SPT-003'", Decimal('59.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5)),
 ("'electronics'", "'Iphone28'", "'The latest Iphone technology.'", "'001-ELC-004'", Decimal('999.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5)),
 ("'grocery'", "'Fresh Bagels'", "'Fresh bagels, delivered from our a bakery.'", "'001-GRO-005'", Decimal('6.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5)),
 ("'automotive'", "'Air Freshener'", "'Clip on vent air freshener.'", "'001-AUT-001'", Decimal('6.99'), datetime.datetime(2023, 4, 24, 19, 45, 5), datetime.datetime(2023, 4, 24, 19, 45, 5))]

## The 'product_inventory' table

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

In [80]:
%%sql
CREATE TABLE product_inventory (
    inventory_id INT PRIMARY KEY AUTO_INCREMENT,  #
    product_id INT,
    quantity INT,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    CONSTRAINT PRODUCT_SUPPORTS_INVENTORY FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

## The 'product_discount' table

In [551]:
%%sql
drop table if exists product_discount;

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

### One discount can be applied to one product at a time.

In [527]:
%%sql
CREATE TABLE product_discount (
    discount_id INT PRIMARY KEY AUTO_INCREMENT,  #
    product_id INT,
    discount_name VARCHAR(40),  # e.g., 'July 4th Flash Sale'
    discount_percent DECIMAL(5,2),  # holds the percentage discount rate
    discount_desc VARCHAR(200),  # e.g., "In honor of independence day all T-shirts are 50% off!"
    active BOOLEAN DEFAULT false,  # the discount is assumed to be unactive until a user turns it on.
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    modified_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
    
    # Without a product, there is no product discount.
    CONSTRAINT PRODUCT_SUPPORTS_DISCOUNT FOREIGN KEY (product_id) REFERENCES product(product_id) ON DELETE CASCADE
);

 * mysql://jasi9001:***@applied-sql.cs.colorado.edu:3306/jasi9001
0 rows affected.

[]

# product isA category!
## For example a tent belongs to the Outdoor Category.

### Now we can easily run a query to find the cross-section of users who also have admin rights in the system.